liuquanli1970/Display-Chinese-in-LCD-with-ESP32-/utility/In_eSPI.h
/***************************************************
  Arduino TFT graphics library targeted at ESP8266
  and ESP32 based boards.

  This is a standalone library that contains the
  hardware driver, the graphics functions and the
  proportional fonts.

  The larger fonts are Run Length Encoded to reduce
  their FLASH footprint.

 ****************************************************/

// Stop fonts etc being loaded multiple times
#ifndef _In_eSPIH_
#define _In_eSPIH_

#define TFT_ESPI_VERSION "1.4.21"

//#define ESP32 //Just used to test ESP32 options

// Include header file that defines the fonts loaded, the TFT drivers
// available and the pins to be used
#include "In_eSPI_Setup.h"

#ifndef TAB_COLOUR
  #define TAB_COLOUR 0
#endif

// If the frequency is not defined, set a default
#ifndef SPI_FREQUENCY
  #define SPI_FREQUENCY  20000000
#endif

// If the frequency is not defined, set a default
#ifndef SPI_READ_FREQUENCY
  #define SPI_READ_FREQUENCY SPI_FREQUENCY
#endif

#if defined(ST7789_DRIVER) || defined(ST7789_2_DRIVER)
  #define TFT_SPI_MODE SPI_MODE3
#else
  #define TFT_SPI_MODE SPI_MODE0
#endif

// If the frequency is not defined, set a default
#ifndef SPI_TOUCH_FREQUENCY
  #define SPI_TOUCH_FREQUENCY  2500000
#endif

#ifdef LOAD_FONT2
  #include <Fonts/Font16.h>
#endif

#ifdef LOAD_FONT4
  #include <Fonts/Font32rle.h>
  #define LOAD_RLE
#endif

#ifdef LOAD_FONT6
  #include <Fonts/Font64rle.h>
  #ifndef LOAD_RLE
    #define LOAD_RLE
  #endif
#endif

#ifdef LOAD_FONT7
  #include <Fonts/Font7srle.h>
  #ifndef LOAD_RLE
    #define LOAD_RLE
  #endif
#endif

#ifdef LOAD_FONT8
  #include <Fonts/Font72rle.h>
  #ifndef LOAD_RLE
    #define LOAD_RLE
  #endif
#endif

#include <Arduino.h>
#include <Print.h>

#include <pgmspace.h>

#include <SPI.h>

#ifdef ESP32
  #include "soc/spi_reg.h"
  #ifdef USE_HSPI_PORT
    #define SPI_PORT HSPI
  #else
    #define SPI_PORT VSPI
  #endif
#endif

#ifndef TFT_DC
  #define DC_C // No macro allocated so it generates no code
  #define DC_D // No macro allocated so it generates no code
#else
  #if defined (ESP8266) && (TFT_DC == 16)
    #define DC_C digitalWrite(TFT_DC, LOW)
    #define DC_D digitalWrite(TFT_DC, HIGH)
  #elif defined (ESP32)
    #if defined (ESP32_PARALLEL)
      #define DC_C GPIO.out_w1tc = (1 << TFT_DC)
      #define DC_D GPIO.out_w1ts = (1 << TFT_DC)

    #else
      #if TFT_DC >= 32
        #ifdef RPI_ILI9486_DRIVER  // RPi display needs a slower DC change
          #define DC_C GPIO.out1_w1ts.val = (1 << (TFT_DC - 32)); \
                       GPIO.out1_w1tc.val = (1 << (TFT_DC - 32))
          #define DC_D GPIO.out1_w1tc.val = (1 << (TFT_DC - 32)); \
                       GPIO.out1_w1ts.val = (1 << (TFT_DC - 32))
        #else
          #define DC_C GPIO.out1_w1tc.val = (1 << (TFT_DC - 32))//;GPIO.out1_w1tc.val = (1 << (TFT_DC - 32))
          #define DC_D GPIO.out1_w1ts.val = (1 << (TFT_DC - 32))//;GPIO.out1_w1ts.val = (1 << (TFT_DC - 32))
        #endif
      #else
        #if TFT_DC >= 0
          #ifdef RPI_ILI9486_DRIVER  // RPi display needs a slower DC change
            #define DC_C GPIO.out_w1ts = (1 << TFT_DC); \
                         GPIO.out_w1tc = (1 << TFT_DC)
            #define DC_D GPIO.out_w1tc = (1 << TFT_DC); \
                         GPIO.out_w1ts = (1 << TFT_DC)
          #else
            #define DC_C GPIO.out_w1tc = (1 << TFT_DC)//;GPIO.out_w1tc = (1 << TFT_DC)
            #define DC_D GPIO.out_w1ts = (1 << TFT_DC)//;GPIO.out_w1ts = (1 << TFT_DC)
          #endif
        #else
          #define DC_C
          #define DC_D
        #endif
      #endif
    #endif
  #else
    #define DC_C GPOC=dcpinmask
    #define DC_D GPOS=dcpinmask
  #endif
#endif

#if defined (TFT_SPI_OVERLAP)
  #undef TFT_CS
  #define SPI1U_WRITE (SPIUMOSI | SPIUSSE | SPIUCSSETUP | SPIUCSHOLD)
  #define SPI1U_READ  (SPIUMOSI | SPIUSSE | SPIUCSSETUP | SPIUCSHOLD | SPIUDUPLEX)
#else
  #ifdef ESP8266
    #define SPI1U_WRITE (SPIUMOSI | SPIUSSE)
    #define SPI1U_READ  (SPIUMOSI | SPIUSSE | SPIUDUPLEX)
  #endif
#endif

#ifndef TFT_CS
  #define CS_L // No macro allocated so it generates no code
  #define CS_H // No macro allocated so it generates no code
#else
  #if defined (ESP8266) && (TFT_CS == 16)
    #define CS_L digitalWrite(TFT_CS, LOW)
    #define CS_H digitalWrite(TFT_CS, HIGH)
  #elif defined (ESP32)
    #if defined (ESP32_PARALLEL)
      #define CS_L // The TFT CS is set permanently low during init()
      #define CS_H
    #else
      #if TFT_CS >= 32
        #ifdef RPI_ILI9486_DRIVER  // RPi display needs a slower CS change
          #define CS_L GPIO.out1_w1ts.val = (1 << (TFT_CS - 32)); \
                       GPIO.out1_w1tc.val = (1 << (TFT_CS - 32))
          #define CS_H GPIO.out1_w1tc.val = (1 << (TFT_CS - 32)); \
                       GPIO.out1_w1ts.val = (1 << (TFT_CS - 32))
        #else
          #define CS_L GPIO.out1_w1tc.val = (1 << (TFT_CS - 32)); GPIO.out1_w1tc.val = (1 << (TFT_CS - 32))
          #define CS_H GPIO.out1_w1ts.val = (1 << (TFT_CS - 32))//;GPIO.out1_w1ts.val = (1 << (TFT_CS - 32))
        #endif
      #else
        #if TFT_CS >= 0
          #ifdef RPI_ILI9486_DRIVER  // RPi display needs a slower CS change
            #define CS_L GPIO.out_w1ts = (1 << TFT_CS); GPIO.out_w1tc = (1 << TFT_CS)
            #define CS_H GPIO.out_w1tc = (1 << TFT_CS); GPIO.out_w1ts = (1 << TFT_CS)
          #else
            #define CS_L GPIO.out_w1tc = (1 << TFT_CS);GPIO.out_w1tc = (1 << TFT_CS)
            #define CS_H GPIO.out_w1ts = (1 << TFT_CS)//;GPIO.out_w1ts = (1 << TFT_CS)
          #endif
        #else
          #define CS_L
          #define CS_H
        #endif
      #endif
    #endif
  #else
    #define CS_L GPOC=cspinmask
    #define CS_H GPOS=cspinmask
  #endif
#endif

// Use single register write for CS_L and DC_C if pins are both in range 0-31
#ifdef ESP32
  #ifdef TFT_CS
    #if (TFT_CS >= 0) && (TFT_CS < 32) && (TFT_DC >= 0) && (TFT_DC < 32)
      #ifdef RPI_ILI9486_DRIVER  // RPi display needs a slower CD and DC change
        #define CS_L_DC_C GPIO.out_w1tc = ((1 << TFT_CS) | (1 << TFT_DC)); \
                          GPIO.out_w1tc = ((1 << TFT_CS) | (1 << TFT_DC))
      #else
        #define CS_L_DC_C GPIO.out_w1tc = ((1 << TFT_CS) | (1 << TFT_DC)); GPIO.out_w1tc = ((1 << TFT_CS) | (1 << TFT_DC))
      #endif
    #else
      #define CS_L_DC_C CS_L; DC_C
    #endif
  #else
    #define CS_L_DC_C CS_L; DC_C
  #endif
#else // ESP8266
  #define CS_L_DC_C CS_L; DC_C
#endif

// chip select signal for touchscreen
#ifndef TOUCH_CS
  #define T_CS_L // No macro allocated so it generates no code
  #define T_CS_H // No macro allocated so it generates no code
#else
  #define T_CS_L digitalWrite(TOUCH_CS, LOW)
  #define T_CS_H digitalWrite(TOUCH_CS, HIGH)
#endif


#ifdef TFT_WR
  #if defined (ESP32)
    #define WR_L GPIO.out_w1tc = (1 << TFT_WR)
    #define WR_H GPIO.out_w1ts = (1 << TFT_WR)
  #else
    #define WR_L GPOC=wrpinmask
    #define WR_H GPOS=wrpinmask
  #endif
#endif

